In [3]:
import numpy as np 
import pandas as pd

In [33]:
df01=pd.DataFrame({'Name':['aone','atwo','athree','as','sd','df','fg','er','fr'],'Class01':[12,10,12,14,15,16,np.nan,'12-18','13sdf']})

In [34]:
df01

     Name Class01
0    aone      12
1    atwo      10
2  athree      12
3      as      14
4      sd      15
5      df      16
6      fg     NaN
7      er   12-18
8      fr   13sdf

In [35]:
def is_float(x):
    try:
        float(x)
    except:
        return False
    return True

In [36]:
def convert_to_range(x):
    if is_float(x)==False:
        token=x.split('-')
        if len(token)==2:
            return (float(x.split('-')[0])+float(x.split('-')[1]))/2
        else:
            return None
    else:
        return x

In [37]:
df01['Class01']=df01['Class01'].apply(convert_to_range)

In [47]:
df01

     Name  Class01
0    aone     12.0
1    atwo     10.0
2  athree     12.0
3      as     14.0
4      sd     15.0
5      df     16.0
6      fg      NaN
7      er     15.0
8      fr      NaN

In [50]:
df02=df01.dropna()

In [51]:
df02.reset_index(drop=True)

     Name  Class01
0    aone     12.0
1    atwo     10.0
2  athree     12.0
3      as     14.0
4      sd     15.0
5      df     16.0
6      er     15.0